{"/about/":{"data":{"":"","creators#Creators":"Dr. Mohcine Chraibi, Kai Kratz, and Tobias Schrödter","why-this-initiative#Why This Initiative?":"We believe our field needs a comprehensive resource platform to allow everyone, from experienced and upcoming researcher to undergrad student or crowd enthusiasts, to have easy access to:\nOpen-Access Resources: A rich collection of software, data sets, project insights, and new articles, open to everyone.\nModel Explanations: Comprehensive summaries shedding light on various model mechanisms.\nSoftware Discussions: Detailed pages on tools related to pedestrian dynamics.\nConference Insights: Dive deep into post-conference analyses, especially from events like PED and TGF, highlighting the latest innovations.\nCollaborative Involvement: We aim to regularly collaborate with peers, inviting them to contribute and share their groundbreaking work.\nResearch Group Introductions: Featuring introductions to active research teams, enhancing collaboration within the pedestrian dynamics community.\nWe founded PedestrianDynamics.org in the spirit of transparency and openness. While we might be the primary editors and hosts, we stress that this platform does not represent any private interest or corporate entity. Instead, we want it to be a beacon for collective knowledge, collaboration, and advancement in pedestrian dynamics.\nEveryone is welcome to contribute, learn, and expand their horizons.\n"},"title":"About"},"/academic_update/":{"data":{"":"\u0026ldquo;Academic Update\u0026rdquo; is a curated source for the latest happenings in the academic world. From concise overviews of recent conferences to summaries of newly published papers and notable scholarly trends, this space is dedicated to keeping you informed about the ongoing conversations and discoveries in the fields around pedestrian dynamics. Whether you\u0026rsquo;re in academia or simply have an interest in its progress, \u0026ldquo;Academic Update\u0026rdquo; provides a straightforward snapshot of the intellectual developments around us.\nIBIT239th IBIT Conference on Crowdmanagement \u0026amp; Event Safety Management from 8-9 Nov., 2023, in Cologne, Germany. IAFSS2314th International Symposium on Fire Safety Science will be held from 23-27 Oct., 2023, in Tsukuba, Japan. "},"title":"Academic Update"},"/academic_update/iafss23/":{"data":{"":"The International Association for Fire Safety Science organized a Symposium in Tsukuba, Japan during October 2023. This week-long symposium included a track on human behaviour in fire and evacuation and a dedicated workshop on the topic which took place the Sunday before the conference. The Sunday workshop included a set of presentations and discussions related to the ongoing work of the permanent group on human behaviour in fires led by Enrico Ronchi and Erica Kuligowski. This included the arrangement of a webinar series and the development of a research agenda for the field. Several important discussion points were brought up, including the need for training opportunities for early career researchers and a specific event entirely dedicated to the field.\nDuring the symposium, three sessions were dedicated to evacuation along with two keynote talks. The conference was opened by a tribute to Rita Fahy by the chair of IAFSS, Brian Meacham, Erica Kuligowski and Daniel Nilsson. Rita was a pioneer of the field of evacuation modelling with her model Exit89 which was developed in the 80ies and has been used for the investigation of the World Trade Centre performed by the National Institute for Standards and Technology (NIST). Rita passed away during summer 2023, leaving a strong impact on the human behaviour in fire community with her work on the panic misconception, evacuation simulations and quantification of evacuation behaviour for fire engineering applications. The tribute was followed by the Howard Emmons award-winning talk by David Purser focused on understanding evacuation behaviour in presence of smoke and toxic gases.\nExploring single-line walking in immersive virtual reality by Luke de Schot.\nThe talk gave a comprehensive overview on the research in the domain providing valuable insights into the state-of-the-art of fire evacuation behaviour. The second keynote of the symposium was also on the topic of evacuation and was given by Yuki Akizuki. The focus of Akizuki’s talk was evacuation route design considering the impact of reduced visibility conditions due to smoke. Presentations during the symposium included three sessions on evacuation and human behaviour in fire and were chaired by Enrico Ronchi, Rosaria Ono and Daniel Nilsson. They included a wide range of topics, such as the use of novel methods to collect pedestrian movement and evacuation behaviour data (e.g., VR and online experiments), exploration of laypeople knowledge of evacuation, design of evacuation signage and way-finding systems, and evacuation of vulnerable groups such as children and people with functional limitations.\nSheldon Tieszen Student Awards (Foto by Peter Thompson).\nOn the Friday after the Symposium, a group of approximately 15 researchers interested in evacuation behaviour gathered in an informal meeting arranged at the University of Tokyo by Claudio Feliciani. This was a valuable opportunity to discuss collaborative efforts in the field and share experiences concerning pedestrian and evacuation data collection and modelling activities. All in all, the IAFSS Symposium and its related activities have been a fantastic opportunity for the evacuation community to meet and learn from each other research efforts in the field.\nThe 15th IAFSS International Symposium is set to convene in 2026 at the scenic locale of La Rochelle, France. This event promises to continue the esteemed tradition of fostering dialogue and sharing groundbreaking research in the field of fire safety science.\nBy: Enrico Ronchi\nEdited by: Mohcine Chraibi\n"},"title":"IAFSS Symposium 2023"},"/academic_update/ibit23/":{"data":{"":"The 9th IBIT Conference on Crowdmanagement \u0026amp; Event Safety Management took place in Cologne in November. Related to the slogan \u0026ldquo;Knowledge, Network, Responsibility\u0026rdquo;, current challenges, basic knowledge, best practices and research activities were reported and discussed over two days.\nVenue of the IBIT Conference: RheinEnergieSTADION in Cologne\nSabine Funk and her IBIT team put together a comprehensive program that included the following topics, among others:\nCooperation and communication during events Inclusion of people with disabilities Technical support for event safety (e.g. simulations, AI and drones) Last mile / Zone Ex from different perspectives (legal, operational, \u0026hellip;) Best practice examples for e.g. specific safety concepts and managing threat situations Most contributions and discussions were in German - although the English track is growing. On the 2nd day of the conference there was an international track presented by the YES Group, in which, among other things, the lessons learned from the Loveparade were discussed.\nIn addition to presentation and discussion panels, the exhibition area offered the opportunity to get in touch with various companies, institutes and organizations active in the field of event safety and to discuss crowd management strategies using this vivid model as an example:\nNew approach for modeling crowds at major events ;)\nAs a part of the side program, the topic \u0026ldquo;Knowledge transfer from research to practice and vice versa\u0026rdquo; was highlighted in an open discussion round. Barriers to transfer were collected, such as the lack of a common vocabulary, lack of detailed understanding of each other\u0026rsquo;s activities and different time scales of research/practice. While the list of challenges grew longer as the discussion progressed, there were only a few proposed solutions - such as the preparation of scientific publications for specific target groups from practice. The discussion showed that there is still a lot of work to be done in terms of transfer. However, the conference with its established research track is already an effective platform for advancing the exchange between research and practice.\nThe IBIT conference will take place again next year. The exact date and location have not yet been set but will be announced here.\nBy: Jette Schumann\n"},"title":"IBIT Conference 2023"},"/authors/":{"data":{"":" Mohcine Chraibi Civil Safety Research (IAS-7) - Forschungszentrum Jülich Head of the division Pedestrian Dynamics - Modeling at the IAS-7. Research intrests include Modeling, Simulation, Wayfinding, Software Engineering, Validation, Verification\n\u0026nbsp; "},"title":"Authors"},"/models/":{"data":{"":"If you want to present a different pedestrian model, feel free to open an issue on our GitHub or contact us directly!\nCollision Free Speed Generalized Centrifugal Force Social Force "},"title":"Pedestrian Models"},"/models/collision_free_speed_model/":{"data":{"":"","challenges-in-implementing-collision-free-speed-models#Challenges in Implementing Collision Free Speed Models":"Numerical solution of the first-order ordinary differential equation defined by the model is solved as follows:\nUpdate algorithm\nThe implementation of collision-free speed models presents several challenges. One challenge is the lack of definition for agent-wall interactions in the original model. However, this issue has been tackled by proposed enhancements to the model, such as Xu\u0026rsquo;s generalized velocity model. Another challenge lies in accurately calibrating the parameters in both the speed and direction models. In certain symmetrical scenarios, determining a well-defined direction function can be difficult.\nIsotropical direction influence The direction model is uniform, meaning it does not differentiate between various directions of influence. The model treats all directions equally and does not consider specific pedestrian preferences or biases in their movement. This may lead to certain unrealistic situations where the agent\u0026rsquo;s direction is influenced by agents from behind them.\nBalancing Collision Avoidance with Performance: Selecting the Appropriate Time-Step The continuous definition of the model is proved to be collision-free in any situation. However, the discretisation of the model, as often required for computational efficiency, can introduce potential collision problems. While the speed model has a fast and efficient implementation, it is crucial to select a sufficiently small time step when solving the ordinary differential equation with Euler scheme in order to ensure that the model remains collision-free. Therefore, the model is collision-free in discrete time if\n$$\\delta t \\le \\min\\left\\{\\frac T2,\\frac{l(\\sqrt2-1)}{v_0\\sqrt2}\\right\\}$$\nThe condition for collision-free dynamics is determined solely by the parameters of the speed model. For example, if we use parameter values of $T=1$ s, $v_0=1.2$ m/s and $l$, with a smallness condition on the time step approximate to $\\delta t \\le0.072$ s for explicit Euler schemes and circular pedestrian shape.\nParameter calibration Additionally, accurately calibrating the repulsion rate and distance in the direction model can prove challenging due to variation based on specific environmental conditions and crowd dynamics.\n","introduction-to-collision-free-speed-model#Introduction to collision-free speed model":"The collision-free speed model [1] is a mathematical approach designed for pedestrian dynamics, emphasizing the prevention of collisions among agents.\nThe direction in which an agent moves is determined through an isotropic combination of exponential repulsion from nearby agents. The strength of this repulsion is influenced by the proximity to others within their surroundings, treating all directions equally in terms of influence.\nAgents adjust their speed according to the nearest neighbor in their headway, allowing them to navigate through congested areas without overlapping or obstructing each other. The collision-free speed model takes into account the length of the agent, which determines the required space for movement, and the maximum achievable speed of the agent.\nThis simplified and computationally efficient model aims to mirror real-world pedestrian behaviors while maintaining smooth movement dynamics.\n","limitations-of-the-collision-free-speed-model#Limitations of the collision-free speed model":"Despite its ability to simulate pedestrian dynamics and replicate real-world phenomena, the collision-free speed model has some limitations that should be acknowledged.\nInitially, the model operates on basic assumptions and might not encompass the intricate nuances of real pedestrian actions, particularly with its representation of agents as circles. It overlooks elements like response time and visual interpretation. The model may not represent stop-and-go dynamics in crowded regions or gridlocks aptly, unless manifested in confined bottlenecks with a circular form. The model does not take into account other influencing variables like obstacles or environmental conditions that could impact pedestrian movement. Numerous studies have presented different enhancements to the collision-free speed-based pedestrian model with the aim of addressing its limitations and improving the accuracy of pedestrian simulations. For instance, Xu [2] proposed a comprehensive velocity model that takes into account wall influence and incorporates velocity-based ellipses for accurate distance calculations. Moreover, improvements were made to the direction function in order to ensure seamless changes in pedestrian directions during simulation. Similarly, other researchers such as [3], [4], and [5] introduced additional refinements to enhance the direction function further.\n","mathematical-description#Mathematical description":"Models that establish a relationship between speed and spacing, known as the OV function, were originally introduced in traffic flow studies. They have since been adapted for pedestrian modeling, offering a straightforward way to control the fundamental diagram. The collision-free speed model is mathematically represented as a derivative equation for the velocity of each pedestrian. Typically, this can be expressed as\n$$\\dot{\\mathbf{x}}_i=V_i\\big(s_i(\\mathbf{x}_i,\\mathbf{x}_j,\\ldots)\\big)\\times\\mathbf e_i(\\mathbf{x}_i,\\mathbf{x}_j,\\ldots)$$\nwhere $x_i$ represents the position of pedestrian $i$ and $V_i$ represents their speed.\nThe speed function $V_i$ regulates the overall speed of the pedestrian, while the direction function $\\textbf{e}_i$ determines the direction in which the pedestrian moves.\nDirection function The direction function is governed by a weighted sum of exponential repulsion from neighboring pedestrians, which is calibrated by the repulsion rate and distance.\nCalculation of the movement direction\nThis mathematical representation ensures that the pedestrians are able to adjust their speed and direction based on their interactions with neighboring agents, ultimately resulting in a collision-free movement.\n$$\\mathbf e_i(\\mathbf x_i,\\mathbf x_j,\\ldots)=\\frac{1}{N}\\left(\\mathbf e_0+\\sum_j R(s_{i,j})\\right)$$\nwith $\\mathbf e_0$ the desired direction, $N$ a normalization constant such that $|\\mathbf e_i|=1$ and $R(s)=a,\\exp\\big((l-s)/D\\big)$ the repulsion function calibrated by the coefficient $a\u0026gt;0$ and distance $D\u0026gt;0$.\nRepulsive influence in the direction\nSpeed function The velocity is calculated by multiplying two functions: A speed function $V_i$ and a direction function $\\textbf{e}_i$.\nInspired from car-following models, the speed function only depends on the distance to the nearest pedestrian or obstacle in front through an Optimal Velocity (OV) function.\nThe set $J_i$ of pedestrians and obstacles in front is given by\n$$J_i=\\big\\{j,~\\mathbf e_i\\cdot \\mathbf e_{ij}\\le 0~\\text{and}~|\\mathbf e_i^\\perp\\cdot\\mathbf e_{ij}|\\le l/s_{ij}\\big\\}.$$\nThe distance to the nearest pedestrian or obstacle in front is then the minimum $$s_i=\\min_{j\\in J_i}s_{ij}.$$\nIn the following, the OV function is the piecewise linear $$V(s)=\\min\\big\\{v_0,\\max{0,(s-l)/T}\\big\\},$$\nsatisfies\n$$\\begin{align*}V(s)\u0026amp;\\gt0\\quad\\forall s\\gt l\\\\ V(s)\u0026amp;=0\\quad\\forall s\\le\\ell\\end{align*}$$\nOV speed function vs fundamental diagram\nThe spacing is calculated along the direction of motion and is defined as the spacing to the nearest neighbor that may collide with the agent. See following picture:\nCalculation of the minimal speed in the direction of motion\nParameters The collision-free speed model depends on five parameters:\nPedestrian diameter ($l \\ge 0$) Desired speed ($v_0 \u0026gt; 0$) Time gap ($T \u0026gt; 0$) Repulsion rate and distance ($a\u0026gt;0$ and $D\u0026gt;0$) ","references#References":" [1] Tordeux, A., Chraibi, M., Seyfried, A. (2016). Collision-Free Speed Model for Pedestrian Dynamics. In: Knoop, V., Daamen, W. (eds) Traffic and Granular Flow \u0026lsquo;15. https://doi.org/10.1007/978-3-319-33482-0_29\n[2] Xu, Q., Chraibi, M., Tordeux, M., Zhang (2019). Generalized collision-free velocity model for pedestrian dynamics. Physica A: Statistical Mechanics and its Applications, Volume 535. https://doi.org/10.1016/j.physa.2019.122521\n[3] Rzezonka, J., Chraibi, M., Seyfried, A., Hein, B., Schadschneider, A. (2022). An attempt to distinguish physical and socio-psychological influences on pedestrian bottleneck. Royal Society Open Science. https://royalsocietypublishing.org/doi/10.1098/rsos.211822\n[4] Zhang, S., Zhang, J., Chraibi, M., Song, W. (2021). A speed-based model for crowd simulation considering walking preferences. Communications in Nonlinear Science and Numerical Simulation, Volume 95. https://doi.org/10.1016/j.cnsns.2020.105624\n[5] Xu, Q., Chraibi, M., Seyfried, A. (2021). Anticipation in a velocity-based model for pedestrian dynamics. Transportation Research Part C: Emerging Technologies, Volume 133. https://doi.org/10.1016/j.trc.2021.103464\n[6] Tordeux, A. talk in TGF15, Delft. Slides.\n"},"title":"Collision Free Speed Model"},"/models/generalized_centrifugal_force_model/":{"data":{"":"","basic-principles-of-generalized-centrifugal-force-model#Basic Principles of Generalized Centrifugal Force Model":"GCFM belongs to the class of force-based pedestrian models, which view pedestrian movement as the result of forces acting on an individual at any given moment. These so-called acceleration-based models calculate the acceleration of agents by superposing the forces acting on them.\nThe movement of pedestrians is influenced by three main forces in the Generalized Centrifugal Force Model: the destination driving force, the obstacle repulsive force, and the repulsive force between pedestrians. The destination driving force propels individuals towards their intended destinations, taking into account factors such as distance and desired walking speed. On the other hand, the obstacle-repulsive force pushes pedestrians away from obstacles to maintain a safe distance from walls or other objects. Lastly, the repulsive force between pedestrians prevents collisions among them [1].\nThe model considers both the distance between pedestrians and their relative velocities. Using an elliptical volume exclusion instead of a circular one has several advantages. Circular symmetry is inconsistent with the asymmetric space requirements of pedestrians in terms of their motion direction and transverse to it. As a force-based model, GCFM describes the temporal changes in pedestrian movement through the combination of short-range forces acting on them simultaneously.\n","challenges-in-implementing-gcfm#Challenges in Implementing GCFM":"The computational cost of the GCFM is high, as it requires continuous\ncalculations to determine the forces and interactions between pedestrians. This\nincludes calculating distances between ellipses, such as the closest approach\ndistance. Additionally, while the strength of repulsive force decreases with\nincreasing distance between pedestrians, it currently has an infinite range,\nwhich is unrealistic for pedestrian interactions. To address this, we propose\nintroducing a cutoff radius for the force to limit interactions only to\nadjacent pedestrians. However, implementing this cutoff radius requires a\ntwo-sided Hermite-interpolation of the repulsive force and further increases\ncomputational complexity. Furthermore, finding appropriate values for model\nparameters that are independent of neighborhood properties and reduce\noverlapping and oscillation is challenging.","introduction-to-generalized-centrifugal-force-model#Introduction to Generalized Centrifugal Force Model":"The Generalized Centrifugal Force Model [1] is a force-based model that defines the movement of pedestrians through the combination of small-range forces. This model represents the spatial requirement of pedestrians, including their body asymmetry, in an elliptical shape with two axes dependent on speed. The semi-axis representing the dynamic space requirement in the direction of motion increases proportionally as speed increases. Conversely, the semi-axis along the shoulder direction decreases with higher velocities.","limitations-of-the-gcfm#Limitations of the GCFM":"As a force-based model, the GCFM suffers from several drawbacks typical for force-based models, namely the duality problem of overlapping and oscillations.\nIt is possible to reduce the amount of overlapping among agents, by increasing the strength of the repulsive forces. However, this leads inevitably to an increase of oscillations in the movements of agents, which in turn can only be mitigated by decreasing the strength of the repulsive forces. See [2] for a more in-depth analysis of this issue.\n","mathematical-description#Mathematical description":"Elliptical volume exclusion of agents The Generalized Centrifugal Force Model incorporates an elliptical volume exclusion of pedestrians. This means that pedestrians are represented as elliptical disks with two semi-axes, which depend on their speed. The semi-axis representing the dynamic space requirement in the direction of motion ($a$) increases proportionally as speed increases, while the semi-axis along the shoulder direction decreases with higher speed values ($b$).\nThe distance between the borders of the ellipses along a line connecting their centers.\nThe mathematical description of the elliptical volume exclusion in GCFM is as follows\n$$a=a_{\\min }+\\tau_a v_i$$\nand\n$$b=b_{\\max }-\\left(b_{\\max }-b_{\\min }\\right) \\frac{v_i}{v_i^0},$$\nwhere $v_i$ is the speed and $v_i^0$ the desired speed of agent $i$.\nEquation of motion The behavior of agents in motion is influenced by the presence of others, causing them to deviate from a straight path. Drawing parallels to Newtonian mechanics, such deviations or accelerations are attributed to a force. Hence, the equation of motion can be written as:\n$$\\vec{\\ddot x}_i=\\overrightarrow{F_i^{\\mathrm{drv}}}+\\sum_{j \\in \\mathcal{N}_{i}} \\overrightarrow{F_{i j}^{\\mathrm{rep}}}+\\sum_{w \\in \\mathcal{W}_{i}} \\overrightarrow{F_{i w}^{\\mathrm{rep}}}.$$\nDriving force The driving force in the Generalized Centrifugal Force Model is defined as the force that propels pedestrians towards their intended destinations:\n$$\\vec{F}_i^{\\mathrm{drv}}=m_i \\frac{\\overrightarrow{v_i^0}-\\overrightarrow{v_i}}{\\tau}.$$\nPedestrian-pedestrian repulsive force The pedestrian-pedestrian repulsive force in the Generalized Centrifugal Force Model is defined as the force that prevents collisions between pedestrians. By considering the repulsive force between pedestrians, the Generalized Centrifugal Force Model ensures that individuals maintain a safe distance from each other.\n$${\\overrightarrow{F_{i,j}}}_{\\text {rep }}=-m_i k_{i j} \\frac{\\left(\\eta\\left|\\overrightarrow{v_i^0}\\right|+v_{i j}\\right)^2}{d_{i j}} \\overrightarrow{e_{i j}},$$\nwith the relative speed\n$$v_{i j}=\\frac{1}{2}\\left[\\left(\\overrightarrow{v_i}-\\overrightarrow{v_j}\\right) \\cdot \\overrightarrow{e_{i j}}+\\left|\\left(\\overrightarrow{v_i}-\\overrightarrow{v_j}\\right) \\cdot \\overrightarrow{e_{i j}}\\right|\\right],$$\nand a reduction of the influence range to $180^\\circ$ by:\n$$k_{i j}=\\frac{1}{2} \\frac{\\overrightarrow{v_i} \\cdot \\overrightarrow{e_{i j}}+\\left|\\overrightarrow{v_i} \\cdot \\overrightarrow{e_{i j}}\\right|}{v_i}.$$\nThe interpolation of the repulsive force between pedestrians.\nPedestrian-wall repulsive force In the Generalized Centrifugal Force Model, the repulsive force between pedestrians and walls represents the force that propels pedestrians away from walls and other fixed structures. For a pedestrian labeled as $i$, this repulsive force is nullified when $i$ moves parallel to the wall. However, while this force behavior is accurate, it results in minimal repulsion when the pedestrian\u0026rsquo;s trajectory is nearly aligned with the wall.\nFor this reason, we characterize in this model walls by three-point masses acting on pedestrians within a certain interaction range.\nEach wall is modeled as three static point masses acting on pedestrians.\n","references#References:":" [1] Chraibi, M., Seyfried, A., Schadschneider, A. (2010). Generalized centrifugal-force model for pedestrian dynamics, Physical Review E, 82, 4 https://link.aps.org/doi/10.1103/PhysRevE.82.046111 [2] Chraibi, M., Schadschneider, A., Seyfried, A. (2013). On Force-Based Modeling of Pedestrian Dynamics. https://doi.org/10.1007/978-1-4614-8483-7_2 "},"title":"Generalized Centrifugal Force Model"},"/models/social_force_model/":{"data":{"":"","calculating-new-velocity-and-new-position-from-forces#Calculating new velocity and new position from forces":"With the definition of the forces affecting an individual, it is possible to calculate its new speed\n$$ \\overrightarrow{v_{\\mathrm{new}}} = \\overrightarrow{v_i} + [\\overrightarrow{F_i^{\\mathrm{drv}}} + \\frac{\\overrightarrow{F_i^{\\mathrm{rep}}} + \\overrightarrow{F_i^{\\mathrm{obst}}}}{m_i}] \\cdot \\delta T$$ and position $$ \\overrightarrow{\\mathrm{pos}_{\\mathrm{new}}} = \\overrightarrow{\\mathrm{pos}_i} + \\overrightarrow{v_{\\mathrm{new}}} \\cdot \\delta T \\text{.}$$\nHere $m_i$ denotes the mass of $i$ and $\\delta T$ denotes the length one simulation iteration.\n","default-values#Default values":"\nParameter Value Unit $A_i$ 2_000 N $B_i$ 0.08 m $k$ 120_000 $\\mathrm{\\frac{kg}{s^2}}$ $\\kappa$ 240_000 $\\mathrm{\\frac{kg}{m \\cdot s}}$ $r_i$ 0.3 m $\\tau$ 0.5 s $v_i^0$ 0.8 $\\mathrm{\\frac{m}{s}}$ $m$ 80 kg ","driving-force#Driving force":"The driving force defines the force that propels pedestrians towards their intended destinations:\n$$ \\overrightarrow{F_i^{\\mathrm{drv}}}=\\frac{v_i^0\\overrightarrow{e_i^0} - \\overrightarrow{v_i}}{\\tau}$$\n$v_i^0$ is the desired speed $\\overrightarrow{e_i^0}$ is the desired direction $\\overrightarrow{v_i}$ is the currect velocity $\\tau$ is the reaction time Driving Force acting on an agent.\nIn the figure above, the black dot represents an agent. Its radius is represented by the gray circle around it. The desired velocity ($v_i^0 \\overrightarrow{e_i^0}$) is as big as its desired speed and is pointing in the desired direction towards a destination indicated by an X. The driving force of the agent results from the difference between the desired velocity and the current velocity divided by $\\tau$.\n","introduction-to-social-force-model#Introduction to Social Force Model":"The Social Force Model [1] is a force-based model that defines the movement of pedestrians by the combination of different social forces affecting an individual.\nThe model defines forces that affect an individual:\nA driving force A repulsive force An obstacle force The driving force represents a person\u0026rsquo;s desire to move in a certain direction, independent of other people and obstacles. The repulsive force is caused by the interaction between the individuals and causes them to avoid each other in order to avoid collisions. The obstacle force acts in a similar way to the person force to avoid collisions with obstacles in the environment.\n","obstacle-force#Obstacle force":"Obstacles exert a force on the agent similar to a static agent. Each line segment of an obstacle exerts force on the agent. The repulsive force is increases exponentially with decreasing distance. When the agent collides with the segment the repulsive forces are increased additionally. When colliding, a frictional force also occurs, which acts orthogonally to the repulsive force in the direction to the velocity of the agent\n$$ \\overrightarrow{F_i^{\\mathrm{obst}}} = \\sum_{o} \\overrightarrow{f_{io}\\text{.}}$$\n$$\\overrightarrow{f_{io}} = [A_i \\exp[(r_{i} - d_{io})/B_i] + kg(r_{i} - d_{io})] \\overrightarrow{n_{io}} + \\kappa g(r_{i} - d_{io}) (\\overrightarrow{v_{i}}\\cdot\\overrightarrow{t_{io}}) \\overrightarrow{t_{io}} \\text{.}$$\n$$\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;}\\fbox{\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;} pushing \\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;..}} \\fbox{\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;.} sliding \\phantom{\u0026hellip;\u0026hellip;\u0026hellip;.}}$$\n$o$ is a segment of the obstacle $r_i$ is the radius agent $i$ $d_{io}$ is distance from closest point on the segement to $i$ $\\overrightarrow{n_{io}} = (n_{io}^1, n_{io}^2) = (\\overrightarrow{\\mathrm{pos}_i} - \\overrightarrow{\\mathrm{pos}_o})/d_{io}$ the direction from $\\overrightarrow{\\mathrm{pos}_o}$ the closest point on the segment to $i$ $ \\overrightarrow{t_{io}} = (- n_{io}^2, n_{io}^1)$ is the tangent of $\\overrightarrow{n_{io}}$ which is perpendicular to it, rotated counterclockwise $v_i$ is the velocity of $i$ $A_i$, $B_i$, $k$ and $\\kappa$ are constants (see default values) $g$ represents the distance between a pedestrian and an obstacle segment when they are in contact, and is zero when there is no contact. $g(x)~=~\\begin{cases} x \\text{ if } x \u0026gt; 0 \\ \\text{ else } 0 \\end{cases}$ Direction of repulsive forces acting on an agent.\nthe repulsive force originating from a segment of an obstacle acts from the point on the wall segment that is closest to the agent. This point is marked in magenta in the illustration above.\nDirection of the pushing and frictional forces acting on agents colliding with an obstacle segment.\nWhen the minimum distance between an agent and a wall segment falls below the agent\u0026rsquo;s radius, an additional frictional force comes into effect. This frictional force acts orthogonally to the repulsive force in the direction of the velocity of the agent.\n","references#References":" [1] Helbing, D., Farkas, I., Vicsek, T. (2000). Simulating dynamical features of escape panic. In: Nature https://doi.org/10.1038/35035023 ","repulsive-force#Repulsive force":"Agents exert an exponentially increasing repulsive force on each other as their proximity decreases. Upon collision, not only do the pushing forces intensify further, but a frictional force also arises. This frictional force acts perpendicularly to the repulsive force, aligning with the direction of the difference in speed\n$$ \\overrightarrow{F_i^{\\mathrm{rep}}} = \\sum_{j} \\overrightarrow{f_{ij}}\\text{.}$$\n$$\\overrightarrow{f_{ij}} = [A_i \\exp[(r_{ij} - d_{ij})/B_i] + kg(r_{ij} - d_{ij})] \\overrightarrow{n_{ij}} + \\kappa g(r_{ij} - d_{ij}) \\Delta v_{ji}^t \\overrightarrow{t_{ij}} \\text{.}$$\n$$\\phantom{\u0026hellip;\u0026hellip;}\\fbox{\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;..} pushing \\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;..}} \\fbox{\\phantom{\u0026hellip;\u0026hellip;} sliding \\phantom{\u0026hellip;\u0026hellip;}}$$\n$j$ is another agent $r_{ij} = r_i + r_j$ is the combined radius of $i$ and $j$ $d_{ij}$ is the distance between $i$ and $j$ $A_i$, $B_i$, $k$ and $\\kappa$ are constants (see default values) $g$ represents the distance between pedestrians when they are in contact, and is zero when there is no contact. $g(x)~=~\\begin{cases} x \\text{ if } x \u0026gt; 0 \\ \\text{ else } 0 \\end{cases}$ $ \\overrightarrow{n_{ij}} = (n_{ij}^1, n_{ij}^2) = (\\overrightarrow{\\mathrm{pos}_i} - \\overrightarrow{\\mathrm{pos}_j})/d_{ij} $ is the normalised vector from $j$ to $i$ $ \\overrightarrow{t_{ij}} = (- n_{ij}^2, n_{ij}^1)$ is the tangent of $\\overrightarrow{n_{ij}}$ which is perpendicular to it, rotated counterclockwise $\\Delta v_{ji}^t = (\\overrightarrow{v_j} - \\overrightarrow{v_i}) \\cdot \\overrightarrow{t_{ij}}$ is the tangential velocity difference of $i$ and $j$ Direction of repulsive forces acting on an agent.\nThe repulsive force of the agents acts from the originating agent towards the agent on which the forces act. When their distance greater than their combined radius no other forces apply.\nDirection of the pushing and frictional forces acting on colliding agents.\nIf the distance between two agents is smaller than their combined radius, the agents collide and a frictional force also occurs. This frictional force acts orthogonally to the repulsive force in the direction of the velocity difference of the two agents.\n"},"title":"Social Force Model"},"/open_source_software/":{"data":{"":"If you know other open source software that fits the borad category of pedestrian dynamics we would like to hear about it! Feel free to open an issue on our GitHub or contact us directly!\nPedPyA Python module to analyze real and simulated pedestrian trajectories. JuPedSimA Python module to simulate pedestrian dynamics. VADEREA Java framework for the simulation of microscopic pedestrian and crowd dynamics. PeTrackAutomatic Extraction of Pedestrian Trajectories from Video Recordings. UMANSC++ crowd-simulation framework for experimentation and for honest comparisons between algorithms. "},"title":"Open Source Software"}}