{"/about/":{"data":{"":"","creators#Creators":"Dr. Mohcine Chraibi, Kai Kratz, and Tobias Schrödter","why-this-initiative#Why This Initiative?":"We believe our field needs a comprehensive resource platform to allow everyone, from experienced and upcoming researcher to undergrad student or crowd enthusiasts, to have easy access to:\nOpen-Access Resources: A rich collection of software, data sets, project insights, and new articles, open to everyone.\nModel Explanations: Comprehensive summaries shedding light on various model mechanisms.\nSoftware Discussions: Detailed pages on tools related to pedestrian dynamics.\nConference Insights: Dive deep into post-conference analyses, especially from events like PED and TGF, highlighting the latest innovations.\nCollaborative Involvement: We aim to regularly collaborate with peers, inviting them to contribute and share their groundbreaking work.\nResearch Group Introductions: Featuring introductions to active research teams, enhancing collaboration within the pedestrian dynamics community.\nWe founded PedestrianDynamics.org in the spirit of transparency and openness. While we might be the primary editors and hosts, we stress that this platform does not represent any private interest or corporate entity. Instead, we want it to be a beacon for collective knowledge, collaboration, and advancement in pedestrian dynamics.\nEveryone is welcome to contribute, learn, and expand their horizons.\n"},"title":"About"},"/academic_update/":{"data":{"":"\u0026ldquo;Academic Update\u0026rdquo; is a curated source for the latest happenings in the academic world. From concise overviews of recent conferences to summaries of newly published papers and notable scholarly trends, this space is dedicated to keeping you informed about the ongoing conversations and discoveries in the fields around pedestrian dynamics. Whether you\u0026rsquo;re in academia or simply have an interest in its progress, \u0026ldquo;Academic Update\u0026rdquo; provides a straightforward snapshot of the intellectual developments around us.\nDynamics of WaitingThis research seeks to fill the gap on the impact of stationary pedestrians on crowd dynamics. IBIT239th IBIT Conference on Crowdmanagement \u0026amp; Event Safety Management from 8-9 Nov., 2023, in Cologne, Germany. IAFSS2314th International Symposium on Fire Safety Science will be held from 23-27 Oct., 2023, in Tsukuba, Japan. TGF24The 15th edition of Traffic and Granular Flow (TGF), December 2-5, 2024, in Lyon, France. PTED245th Workshop on Pedestrian Traffic and Evacuation Dynamics was held in Hefei, Anhui Province in China from December 13th to 15th 2024. "},"title":"Academic Update"},"/academic_update/hefei24/":{"data":{"":"","looking-ahead#Looking ahead":"The 6th Workshop on Pedestrian Traffic and Evacuation Dynamics (2025) is set to convene next year again at the University of Science and Technology of China, Hefei, China. The exact date has not yet been set but will be announced soon.\nBy: Jun Zhang\nEdited by: Mohcine Chraibi\n","participants#Participants":"110 scholars from 40 institutions including the University of Melbourne, Tsinghua University, Chongqing University, University of Science and Technology of China, Beijing Jiaotong University, Sun Yat-sen University, Wuhan University of Technology, Southwest Jiaotong University, Shanghai Institute of Technology, Shanghai Maritime University, Jiangsu University, Fuzhou University, Nanjing University of Technology, Beihang University, University of Tokyo, Hong Kong Polytechnic University, and City University of Hong Kong participated.\nParticipants and inaugural opening speech by Prof. Song.\n","talks#Talks":"Prof. Majid Sarvi from the University of Melbourne in Australia, Prof. Zhou Tiejun from Chongqing University, and Prof. Chen Tao from Tsinghua University gave Plenary speeches at the workshop. Prof. Han Xiao from Beijing Jiaotong University, Associate Prof. Cao Shuchao from Jiangsu University, Associate Prof. Xiao Yao from Sun Yat-sen University, Prof. Fu Ming from the Hefei Institute of Public Safety at Tsinghua University, and Associate Prof. Xie Qimiao from Shanghai Maritime University delivered keynote speeches. They shared the latest progress in experimental research, modeling, and application of new technologies in pedestrian traffic and emergency evacuation and provided prospects for the future development of this field.\nBesides, 33 experts and scholars gave wonderful oral presentations. The attendees had in-depth exchanges and discussions on topics such as mixed traffic dynamics, pedestrian evacuation under disaster conditions, personnel safety protection technology, virtual reality technology, and personnel psychology. They shared their latest research results, experiences, and viewpoints, and actively explored new research directions and solutions. The open and interactive environment provides valuable learning and communication opportunities for participants, promoting the collision of ideas and academic progress in various research directions.\nQA-session and moderation by Prof. Zhang.\nDuring the workshop, some of the researchers visited the State Key Laboratory of Fire Science and watched the fire whirlwind demonstration, and learned about the development of the institute and its research achievements in fire science and emergency evacuation.\n","workshop-on-pedestrian-traffic-and-evacuation-dynamics-2024#Workshop on Pedestrian Traffic and Evacuation Dynamics 2024":"The 5th Workshop on Pedestrian Traffic and Evacuation Dynamics (2024) was held in Hefei, Anhui Province in China from December 13th to 15th. It was organized by Prof. Weiguo Song and Prof. Jun Zhang from the State Key Laboratory of Fire Science of University of Science and Technology of China and the National \u0026amp; Local Joint Engineering Research Center of Thermal Safety Technology to discuss new theories, new methods, new technologies and the trends in the research of pedestrian traffic and evacuation dynamics.\nGroup photo of the workshop.\n"},"title":"PTED 2024"},"/academic_update/iafss23/":{"data":{"":"The International Association for Fire Safety Science organized a Symposium in Tsukuba, Japan during October 2023. This week-long symposium included a track on human behaviour in fire and evacuation and a dedicated workshop on the topic which took place the Sunday before the conference. The Sunday workshop included a set of presentations and discussions related to the ongoing work of the permanent group on human behaviour in fires led by Enrico Ronchi and Erica Kuligowski. This included the arrangement of a webinar series and the development of a research agenda for the field. Several important discussion points were brought up, including the need for training opportunities for early career researchers and a specific event entirely dedicated to the field.\nDuring the symposium, three sessions were dedicated to evacuation along with two keynote talks. The conference was opened by a tribute to Rita Fahy by the chair of IAFSS, Brian Meacham, Erica Kuligowski and Daniel Nilsson. Rita was a pioneer of the field of evacuation modelling with her model Exit89 which was developed in the 80ies and has been used for the investigation of the World Trade Centre performed by the National Institute for Standards and Technology (NIST). Rita passed away during summer 2023, leaving a strong impact on the human behaviour in fire community with her work on the panic misconception, evacuation simulations and quantification of evacuation behaviour for fire engineering applications. The tribute was followed by the Howard Emmons award-winning talk by David Purser focused on understanding evacuation behaviour in presence of smoke and toxic gases.\nExploring single-line walking in immersive virtual reality by Luke de Schot.\nThe talk gave a comprehensive overview on the research in the domain providing valuable insights into the state-of-the-art of fire evacuation behaviour. The second keynote of the symposium was also on the topic of evacuation and was given by Yuki Akizuki. The focus of Akizuki’s talk was evacuation route design considering the impact of reduced visibility conditions due to smoke. Presentations during the symposium included three sessions on evacuation and human behaviour in fire and were chaired by Enrico Ronchi, Rosaria Ono and Daniel Nilsson. They included a wide range of topics, such as the use of novel methods to collect pedestrian movement and evacuation behaviour data (e.g., VR and online experiments), exploration of laypeople knowledge of evacuation, design of evacuation signage and way-finding systems, and evacuation of vulnerable groups such as children and people with functional limitations.\nSheldon Tieszen Student Awards (Foto by Peter Thompson).\nOn the Friday after the Symposium, a group of approximately 15 researchers interested in evacuation behaviour gathered in an informal meeting arranged at the University of Tokyo by Claudio Feliciani. This was a valuable opportunity to discuss collaborative efforts in the field and share experiences concerning pedestrian and evacuation data collection and modelling activities. All in all, the IAFSS Symposium and its related activities have been a fantastic opportunity for the evacuation community to meet and learn from each other research efforts in the field.\nThe 15th IAFSS International Symposium is set to convene in 2026 at the scenic locale of La Rochelle, France. This event promises to continue the esteemed tradition of fostering dialogue and sharing groundbreaking research in the field of fire safety science.\nBy: Enrico Ronchi\nEdited by: Mohcine Chraibi\n"},"title":"IAFSS Symposium 2023"},"/academic_update/ibit23/":{"data":{"":"The 9th IBIT Conference on Crowdmanagement \u0026amp; Event Safety Management took place in Cologne in November. Related to the slogan \u0026ldquo;Knowledge, Network, Responsibility\u0026rdquo;, current challenges, basic knowledge, best practices and research activities were reported and discussed over two days.\nVenue of the IBIT Conference: RheinEnergieSTADION in Cologne\nSabine Funk and her IBIT team put together a comprehensive program that included the following topics, among others:\nCooperation and communication during events Inclusion of people with disabilities Technical support for event safety (e.g. simulations, AI and drones) Last mile / Zone Ex from different perspectives (legal, operational, \u0026hellip;) Best practice examples for e.g. specific safety concepts and managing threat situations Most contributions and discussions were in German - although the English track is growing. On the 2nd day of the conference there was an international track presented by the YES Group, in which, among other things, the lessons learned from the Loveparade were discussed.\nIn addition to presentation and discussion panels, the exhibition area offered the opportunity to get in touch with various companies, institutes and organizations active in the field of event safety and to discuss crowd management strategies using this vivid model as an example:\nNew approach for modeling crowds at major events ;)\nAs a part of the side program, the topic \u0026ldquo;Knowledge transfer from research to practice and vice versa\u0026rdquo; was highlighted in an open discussion round. Barriers to transfer were collected, such as the lack of a common vocabulary, lack of detailed understanding of each other\u0026rsquo;s activities and different time scales of research/practice. While the list of challenges grew longer as the discussion progressed, there were only a few proposed solutions - such as the preparation of scientific publications for specific target groups from practice. The discussion showed that there is still a lot of work to be done in terms of transfer. However, the conference with its established research track is already an effective platform for advancing the exchange between research and practice.\nThe IBIT conference will take place again next year. The exact date and location have not yet been set but will be announced here.\nBy: Jette Schumann\n"},"title":"IBIT Conference 2023"},"/academic_update/tgf24/":{"data":{"":"","#":"The 15th edition of the Traffic and Granular Flow (TGF24) conference took place from December 2nd to 5th, 2024, in the beautiful city of Lyon, France. Held at the historic Palais Hirsch and the equally magnificent Palais de la Bourse, the conference offered an inspiring setting along the Rhône River.\nEmergence of behavioral repertoires in entrance situations: Interplay between physical, collective and inter-personal factors - Tom Postmes\nSince its inception in 1995, TGF has been a biennial event that brings together a diverse, interdisciplinary audience, including experts in physics, computer science, engineering, and fields such as pedestrian dynamics, granular flows, collective animal behavior, and urban mobility. This year’s conference continued the tradition of fostering collaboration and innovation by presenting the latest developments and ideas in these areas.\nThe scope of TGF covered a wide range of topics, including:\nInternet traffic and cyber systems, Pedestrian and evacuation dynamics, Urban Mobility, Trafic, Collective animal behavior, Swarm behavior, and Collective dynamics of biological systems. Researchers from across the globe—spanning the USA, UK, Europe, Australia, New Zealand, Japan, China, India, and more—gathered to share their work and form new collaborations, which were facilitated by the smooth organization offering plenty of time for discussions between the partecipants. A particular highlight was the keynote by Andreas Schadschneider, who delivered a retrospective on nearly 30 years of TGF, celebrating its role in connecting scientists across disciplines and continents. Andreas explained how the conference started from a small group of physicists in Germany interested in traffic from a physical perspective and evolved into the global community studying a variety of subjects as it is today.\nTGF Conference Series: A retrospective by Andreas Schadschneider\nAnother memorable presentation was by Ernesto Altshuler, whose talk, From Vortices to People: An Experimental Approach to Traffic, captivated the audience. Ernesto showed, through beautiful videos and funny anecdotes, how systems of different sizes show properties related to traffic systems and concluded his presentation showing some puzzling experiments on collective motion of people.\nThe conference also featured impactful contributions from attendees. For instance, Paul Geoerg and his co-authors presented their research on Mapping Crowd Safety Risks at a Global Scale, which introduced a meticulously curated database of 1,780 crowd-related events from 2000 to 2025. This database tracks incidents such as crowd crushes, terror attacks, and cancellations due to extreme weather, providing valuable insights for safety planning and risk assessment.\nDuring the conference there was also the opportunity to showcase various software that have been created to help researchers working in the community. For instance, Peter Thompson presented a tool intended to visualize results from simulation or experiment in 3D to help gaining a more multi-facet inside into collected data. Ahmed Alia presented a comparison of Deep Learning-based Computer Vision tools used to track people\u0026rsquo;s heads in videos, a kind of software that is increasingly used by a variety of researchers to collect data on crowds.\nIn her invited talk Marta Gonzalez discussed traffic from a macroscopic perspective focusing on mobility patterns of people through data collected on mobile phones. Marta provided an overview of her impressive career presenting a number of graphs in videos in an informative way. On a smaller scale Xiaolu Jia presented a method to obtain origin-destination data of people moving inside a train station in Tokyo (Japan).\nThe conference also included a large number of presentations on pedestrian dynamics, vehicular traffic, collective animal behavior, network theory, and also some touching aspects closer to psychology.\nImpressions and Atmosphere TGF is renowned not only for its academic depth but also for its welcoming and collaborative environment. The informal atmosphere encourages open dialogue, making it easy for participants to engage in meaningful discussions regardless of their gender, nationality, or professional position. First-time attendees often remark on the strong sense of community and the openness to new ideas. Although TGF is held biannually, some participants also meed during the PED conference sharing some of the topics but specifically focused on pedestrian traffic.\nThis inclusivity has been a hallmark of TGF, thanks to the efforts of long-standing contributors like Andreas Schadschneider and Armin Seyfried, who have nurtured this culture over the years. Once again, the conference attracted a wide range of scientists from around the world, with a remarkable balance of ages and genders. Such diversity and openness ensure that the value of the content takes precedence over status.\nAlthough the famous festival of lights was not part of the official program of the conference, many participants took the chance to enjoy the light show in a crowded scene. Probably given the crowd researchers in the conference a more realistic feeling for high densities.\nFestival of lights, Lyon 2024.\nLooking Ahead As the conference came to a close, the steering committee announced that the next edition, TGF26, will be hosted by Nikolai Bode at Bristol University. With its strong foundation of inclusivity and innovation, TGF is set to continue thriving as a platform for cutting-edge research and collaboration. TGF26 is planning to continue the multidisciplinary tradition of TGF and will further extent its coverage to include also robotics, which is increasigly playing an important role in traffic through automated vehicles and swarm robotics. Of course, content from more \u0026ldquo;classical\u0026rdquo; topics typical of the past editions of TGF will be also welcome.\nBy: Ahmed Alia, Thomas Chatagnon, Claudio Feliciani\nEdited by: Mohcine Chraibi\n"},"title":"Traffic and Granular Flow 2024"},"/academic_update/waiting/":{"data":{"":"In many daily situations, as in city centres or public transportation facilities, the dynamics of crowds are dominated by the presence of standing or waiting pedestrians. However, pedestrian\u0026rsquo;s waiting behaviour and interactions with moving persons has only rarely been studied. For example, in the fundamental diagram or in level of service concepts, waiting pedestrians are solely included while standing in queues. Standing in a queue with all surrounding pedestrians orienting in the same direction and probably sharing the same goal to reach, differs significantly from situations in which pedestrians can freely choose their waiting places, such as on platform of a train station.\nIn order to increase the understanding of waiting pedestrians, we contributed a methodology and analysis to describe waiting passengers and their influence on the processes at railway platforms as part of the BMBF-funded project \u0026ldquo;CroMa - Crowd Management in transportation infrastructures\u0026rdquo;. The detailed results can be found in publications [1], [2], [3], [4] and will shortly be presented in the following sections.\n","experiments#Experiments":"As the field studies revealed a higher number of influencing factors, in the next step, large-scale laboratory experiments were conducted [3]. These offer the possibility to study some influencing factors in a controlled environment and under reduced complexity. As variations the setup of the platform (no, narrow or wide obstacle), the number of participants (40 or 100) and their waiting time (2 or 4 minutes) were chosen. The side of train arrival was not varied and known to the participants. Hence, their attention is focused towards the corresponding side and an alignment of viewing directions can be observed.\nUpper panel: experiment setup for 40 participant showing their positions at the end of the waiting time; middle: density profiles for 2 minutes waiting time and 40 participants; lower panel: for 100 participants\nDuring analysis of density profiles, platforms without obstacles were found to lead to uneven passenger distributions as the area close to the entrance was favoured. Obstacles were found to have a two-sided effect: the side facing towards the train arrival is a preferred waiting spot while the opposite side has a repulsive effect. Possible reasons for these effects are the comfort provided by leaning against the obstacle and the reduction of the number of neighbouring persons; the repulsive effects are likely caused by the blocked line of sight towards the goal. Narrow obstacles cause passengers to mainly wait at the side of expected train arrival, while wide obstacles, despite blocking the passenger\u0026rsquo;s view, lead to a more even distribution along the platform. Even though the marked safety line at the platform\u0026rsquo;s edges was not mentioned in the experiment\u0026rsquo;s instructions, participants keep a distance to the edges and seldom cross the safety line.\nFloor Fields Based on the results from both field and experimental studies, pedestrians choose their waiting positions as a trade-off between different factors. These factors can be transferred into floor fields, as previously introduced by [5]. Schematic illustration of influencing factors\na) Distance to entrance: Passengers prefer places in the vicinity of the entrance and do not walk to the far side of the platform.\nb) Distance to exit: Passengers stay at the side of expected train arrival.\nc) Hazard zones: Platform edges have a repulsive effect.\nd) Flow avoidance: Passengers avoid places where they often get in the way of others and are perceived as obstacle.\ne) Stationary obstacles: Obstacles have a two-sided effect: the side facing train arrival acts attractive, the opposite side as repulsive.\nUsing a superposition of these factors, an estimate of attractiveness of waiting places can be generated. Floor fields of attractiveness of waiting positions\nThese do not reproduce the filling processes and dynamics but can be used as basis in simulation studies to determine pedestrian\u0026rsquo;s positioning goals. Details can be found in [3].\n","field-studies#Field Studies":"Studying trajectory data from railway stations, which were kindly provided by Swiss Federal Railways (SBB AG), it became clear that the variability of types of users is important when describing how the space at railway platforms is used. While alighting passengers mostly leave the platform directly, boarding passengers spend a significant amount of time waiting. Therewith their trajectories cover a larger area of the platform and exhibit certain waiting places which can be identified by \u0026lsquo;knots\u0026rsquo; in the trajectories.\nTrajectories of boarding (red) and alighting passengers (blue) at Zürich Hardbrücke, Switzerland, in an exemplary time interval of one hour during the afternoon\nThe arrival of trains structures the space usage at the platform in distinct phases, which can be described by waiting or boarding and alighting. At a two-sided platform these phases can also overlap. Passengers mainly use the side of the platform where the train they intend to board is scheduled to arrive, even if the occupation and density on the other side are much lower. Therefore, both platform sides should be analysed separately.\nAdditionally, the presence of waiting passengers causes the distribution of mean speeds to show a double peak structure: one peak at lower speeds representing the boarding passengers, the second peak corresponding to alighting and moving passengers. Details can be found in [1].\nLeft: Mean speed of all passengers during afternoon peak hours in Bern, Switzerland; Right: mean speed of boarders (red) and alighters (blue)\nSocial Groups and Waiting Time In order to analyse the waiting places of passengers and their space occupancy, in the following investigations a passenger is considered as waiting with a speed less than 0.4 m/s. This threshold was determined through the mean speed distributions of boarding and alighting passengers.\nPrevious research in the field of pedestrian dynamics highlighted the importance to consider differences between social groups and individuals, and also introduced methods to detect those in trajectory data. We used trajectory data collected in February 2020 (28 days) during the afternoon peak hours (4 p.m. to 7 p.m.). We found a lower passenger amount on weekends but a higher percentage of social group members than on working days. Independent of the day of the week, the most frequent group size were pairs. While individual passengers often wait at the sides of stairs and obstacles, social groups with a higher number of members are more likely to wait in front of the platform\u0026rsquo;s entrances. Social groups position themselves in a way that ensures the groups communication, mainly in circles, which results in higher space requirements. Waiting places of social groups and individuals. a) individuals b) groups with 2-3 members c) groups with 4-5 members d) groups with 6 and more members\nRegardless of group membership, the total waiting time influences the choice of waiting places. Passengers with small waiting times position themselves close to the platform entrances, while passengers with longer waiting times prefer undisturbed spaces and also use the rearward sides of stairways and obstacles. Further results are reported in [2]. Waiting places depending on total waiting time a) up to 2 min b) 2-5 min c) 5-10 min d) 10 min and more. The waiting occupation of a certain area states the percentage of time this area is occupied by a waiting pedestrian.\n","outlook#Outlook":"While the investigations were performed in the context of railway platforms, the results can likely be transferred to other situations in which waiting pedestrians are predominant. This is the case in many situations, e.g. during filling processes, in public spaces or during events. Even in queueing experiments pedestrians can often be observed to wait rather than actively try to move towards the exit. Investigations on waiting pedestrians can therefore enhance the understanding of crowd dynamics and are beneficial to include in simulation algorithms. However, there are still many open questions and potential for future works [4].\nBy: Mira Küpper\n","references#References":" [1] Küpper, M. ; Seyfried, A.: Analysis of Space Usage on Train Station Platforms Based on Trajectory Data. Sustainability 12, no. 20: 8325 (2020) https://doi.org/10.3390/su12208325 [2] Küpper,M.; Seyfried, A.: Identification of social groups and waiting pedestrians at railway platforms using trajectory data, PlosOne (2023) https://doi.org/10.1371/journal.pone.0282526 [3] Küpper, M., Seyfried, A.: Waiting in crowded places: influence of number of pedestrians, waiting time and obstacles. J. R. Soc. Interface 20: 20230193. (2023) https://doi.org/10.1098/rsif.2023.0193 [4] Küpper, M.: Space Usage and Waiting Pedestrians at Train Station Platforms, Dissertation Bergische Universität Wuppertal, 2023. http://dx.doi.org/10.34734/FZJ-2024-00602 [5] Ezaki, T., Ohtsuka, K., Chraibi, M., Boltes, M., Yanagisawa, D., Seyfried, A., Schadschneider, A., Nishinari, K. (2016). Inflow Process of Pedestrians to a Confined Space. Collective Dynamics, 1, 1–18. https://doi.org/10.17815/CD.2016.4 "},"title":"The Dynamics of Waiting"},"/authors/":{"data":{"":"Several persons contributed to this website. These are in alphabetically order:\nAhmed Alia Civil Safety Research (IAS-7) - Forschungszentrum Jülich Researcher at Forschungszentrum Jülich, specializing in artificial intelligence for complex data analytics and modeling.\n\u0026nbsp; "},"title":"Authors"},"/models/":{"data":{"":"If you want to present a different pedestrian model, feel free to open an issue on our GitHub or contact us directly!\nCollision Free Speed Anticipation Velocity Model Generalized Centrifugal Force Optimal Steps Model Social Force "},"title":"Pedestrian Models"},"/models/anticipation_velocity_model/":{"data":{"":"","introduction-to-anticipation-velocity-model#Introduction to anticipation velocity model":"","limitations-of-the-anticipation-velocity-model#Limitations of the anticipation velocity model":"","mathematical-description#Mathematical description":"","references#References:":"Introduction to anticipation velocity model The anticipation velocity model (AVM) 1 is a mathematical approach designed for pedestrian dynamics. It represents a further development of the collision-free speed model 2, extending its framework by incorporating pedestrian anticipation. This anticipation process is structured into three components: perception of the current situation, prediction of a future situation, and selection of a strategy that leads to action.\nSimilar to the Collision-Free Speed Model, the direction in which an agent moves is determined through an anisotropic combination of exponential repulsion from nearby agents within its vision field. However, the strength of this repulsion is influenced by the predicted distance to others in the surroundings, rather than the actual distance used in the Collision-Free Speed Model.\nThe calculation of the speed is completely the same as the collision-free speed model. Agents adjust their speed according to the nearest neighbor in their headway, allowing them to navigate through congested areas without overlapping or obstructing each other.\nThe anticipation mechanism incorporated in the AVM enables it to reproduce lane formation in bidirectional flow scenarios more realistically than the Collision-Free Speed Model. Additionally, the AVM is more effective in preventing jamming in such scenarios and offers improved accuracy in reproducing the fundamental diagram.\nThis video shows a short introduction of the model and some simulations demonstrating its capabilities.\nMathematical description In AVM, an agent is represented as a disk with a constant radius $r$. The position and velocity of agent $i$ are denoted by $\\vec{x}_i$ and $\\vec{v}_i$, respectively, where $\\vec{v}_i=\\dot{\\vec{x}}_i$. Furthermore, $\\vec{v}_i=\\vec{e}_i\\cdot v_i$, where $\\vec{e}_i$ and $v_i$ denote the direction of movement and the speed of agent $i$, respectively.\nDirection function The desired direction of agent $i$ is denoted by $\\vec{e}_i^{~0}$, a unit vector pointing towards its target. Then the process of operational navigation to avoid collisions and obstructions can be divided into three parts.\na. Perception of the actual situation: To consider restrictions using visual perception, it is assumed that only agents located in the union of two half-planes, where $i$ is moving or intends to move, affect its direction. The set containing all agents who have an impact on $i$\u0026rsquo;s direction of movement is\n$$N_i(t)=\\bigg{j,~\\vec{e}i(t) \\cdot \\vec{e}{i,j}(t)\u0026gt;0\\ \\text{or}\\ \\vec{e}i^{\\ 0}(t) \\cdot \\vec{e}{i,j}(t)\u0026gt;0\\bigg},$$\nwhere $\\vec{e}_{i,j}$ denotes the unit vector from $i$ to $j$.\nThe agents who are located in the gray area have an impact\nb. Prediction of a future situation: To consider the prediction, it is assumed that the strength of $j$\u0026rsquo;s impact on $i$ is a function of the predicted distance between these two agents at a particular time point. Given a time constant $t^\\text{a}$, which can be interpreted as the prediction time, the predicted distance is defined as\n$${s}^{\\text{a}}_{i,j}(t+t^{\\text{a}}) =\\max\\Big\\{2r, \\Big(\\vec{x}^\\text{a}_j (t+t^\\text{a})-\\vec{x}^\\text{a}_i(t+t^\\text{a})\\Big)\\vec{e}_{ij}(t)\\Big\\},$$\nwhere $\\vec{x}^\\text{a}_i(t+t^\\text{a})=\\vec{x}_i(t)+\\vec{v}_i(t)\\cdot t^\\text{a}$.\nThe agents who are located in the gray area have an impact\nc. Selection of a strategy leading to an action: After the introduction of the predicted distance, the strength of the impact from agent $j$ on the direction of movement of agent $i$ is defined as\n$$ R_{i,j}(t)= \\alpha_{i,j}(t) \\cdot \\exp \\bigg( \\frac{2 r-s^\\text{a}_{i,j}(t+t^\\text{a})}{D} \\bigg),$$\nwhere $D\u0026gt;0$ is a constant parameter used to calibrate the range of the impact from neighbors and $\\alpha_{i,j}$ is a directional dependency used to vary the strength of impact from different neighbors.\n$$\\alpha_{i,j}(t)=k \\Big(1+ \\frac{1- \\vec{e}_i^{~0}(t) \\cdot \\vec{e}_j(t)}{2}\\Big),\\; k\u0026gt;0 ,$$\nwhere $\\alpha_{i,j}$ is minimal when both vectors $\\vec{e}_i^{~0}$ and $\\vec{e}_j$ are aligned and is maximum when they are anti-aligned, which means that agents influence each other\u0026rsquo;s direction strongly in bidirectional scenarios.\nHere, $\\alpha_{i,j}$ means agents have a high tendency to follow the agents who move in the same direction. When this strategy is used, the probability of further conflicts is reduced.\nThe direction of the impact from agent $j$ on $i$\u0026rsquo;s direction of the movement is defined as\n$$\\vec{n}_{i,j}(t) =-\\text{sgn} \\bigg(\\vec{e}^{~\\text{a}}(t+t^\\text{a}) \\cdot \\vec{e}_i^{~0\\bot}(t) \\bigg)$$\nwhere\n$\\vec{e}^{~\\text{a}}(t+t^\\text{a})= \\vec{x}^\\text{a}_j(t+t^\\text{a})- \\vec{x}_i(t)$.\nThe direction of $\\vec{n}_{i,j}$ depends on the predicted position of agent $j$ after as period of time $t^\\text{a}$.\nNote that when this predicted position is aligned with the desired direction of $i$, the direction of $\\vec{n}_{i,j}(t)$ is chosen randomly as $\\vec{e}_i^{~0\\bot}$ or $-\\vec{e}_i^{~0\\bot}$. This rule prevents agents from moving in the opposite direction to the desired direction.\nThe agents who are located in the gray area have an impact\nFinally, the optimal direction of agent $i$, $\\vec{e_i}^{~\\text{d}}(t)$ is obtained as\n$$u \\bigg(\\vec{e_i}^{~0}(t)+ \\sum_{j\\in N_i(t)} R_{j,i}(t)\\cdot \\vec{n}_{j,i}(t)\\bigg),$$\nwhere $u$ is a normalization constant such that $\\lVert\\vec{e}_i^{~\\text{d}}\\rVert=1$. Then, the direction of movement of agent $i$ is updated as\n$$\\frac{d\\vec{e_i}(t)}{dt} = \\frac{ \\vec{e_i}^{~\\text{d}}(t)-\\vec{e}_{i}(t)}{\\tau},$$\nwhere $\\tau$ is a relaxation parameter adjusting the rate of the turning process from the current direction $\\vec{e}_i$ to the optimal direction $\\vec{e}_i^{~d}$.\nSpeed function After obtaining the new direction of the movement, the set of neighbors that are imminently colliding with $i$ is defined as\n$$J_i= \\Big( j,\\;\\vec{e_i} \\cdot \\vec{e_{i,j}} \\ge 0\\ \\text{and}\\ \\left| \\vec{e_i}^{~\\bot} \\cdot \\vec{e_{i,j}} \\right| \\leq \\frac{2 r}{s_{i,j}} \\Big) ,$$\nwhere $s_{i,j}$ is the current distance between $i$ and $j$. Therefore, the maximum distance that agent $i$ can move in the direction without overlapping other agents is\n$$s_i=\\min_{j\\in J_i}s_{i,j}-2r.$$\nCalculation of the speed in the direction of movement\nFinally, the speed of agent $i$ in the new direction is\n$$v_i=\\min\\Big\\{v_i^0,~\\max\\big\\{0,\\frac{s_{i}}{T}\\big\\}\\Big\\},$$\nwhere $v_i^0$ is the free speed of agent $i$, and $T\u0026gt;0$ is the slope of the speed-headway relationship.\nParameters The anticipation velocity model depends on seven parameters:\nPedestrian radius ($r\u0026gt;0$) Free speed ($v^0\\ge 0$) Time gap ($T\u0026gt;0$) Repulsion rate and distance ($k\u0026gt;0$ and $D\u0026gt;0$) Rate of turning process ($\\tau\u0026gt;0$) Prediction time ($t^\\text{a}\\ge 0$) Limitations of the anticipation velocity model Despite the AVM demonstrating superior performance in bidirectional flow scenarios compared to traditional models such as the collision-free speed model (CSM), there are still notable limitations:\nRealism Gap: Although the AVM represents an improvement over the CSM, it does not fully capture real-world pedestrian behavior. While the model incorporates anticipation, it overlooks key aspects of human interactions, such as cooperation, pushing, and waiting, which are prevalent in high-density crowds. Consequently, the AVM faces challenges in accurately representing extreme crowd dynamics. For instance, in scenarios with very high pedestrian densities and multi-directional flows, gridlock can still occur.\nModel Robustness: The robustness of the AVM is limited when compared to the CSM. A key difference is that the AVM excludes backward movement, which is often observed in real-world crowds. While backward movement in the CSM is not directly modeled, it still occurs and contributes to solving conflicts between agents. By removing this behavior, the AVM becomes less adaptable to certain crowd configurations, particularly when faced with complex interactions.\nParameter Sensitivity: Some parameter values in the AVM are scenario-dependent. In particular, the anticipation parameter plays a significant role in sparse densities, where agents can effectively anticipate new avoidance opportunities. However, in high-density situations, the limited space for avoidance reduces the usefulness of anticipation and can even lead to numerical issues in the simulation.\nWall implementation in the Anticipation Velocity Model In the original publication of the AVM, walls are implemented as static agents, with interactions based on the nearest point on the wall to an agent. In high-density scenarios, this approach can lead to imbalances, where agents are pushed towards walls by others, but the walls are unable to exert sufficient repulsive influence to push them back. A common solution to this issue involves calibrating wall parameters to make the repulsion strong enough to counteract the influence of surrounding agents.\nHowever, in the JuPedSim implementation, wall interactions are designed differently. Walls are treated as gliding surfaces, meaning agents adjust their movement to avoid collisions while maintaining smooth trajectories along wall boundaries. The influence of walls on an agent\u0026rsquo;s movement is determined by the agent\u0026rsquo;s distance to the wall and their movement direction.\nImportantly, walls do not affect the speed of agents—only their direction. Agents glide along walls by subtly adjusting their trajectory while preserving their intended movement as much as possible. This influence transitions smoothly as agents move closer to or farther from the wall, ensuring realistic and continuous behavior near boundaries.\nUsing the anticipation velocity model with JuPedSim The anticipation velocity model has also been implemented and tested using the JuPedSim software platform (VelocityModelBuilder).\nFollowing table summarize the parameters of the model and their naming.\nParameter Description Variable Name Pedestrian size radius Desired speed v0 Time gap time_gap Repulsion rate for agents interaction strength_neighbor_repulsion Repulsion distance for agents interaction range_neighbor_repulsion Rate of turning process reaction_time Prediction time anticipation_time To determine the desired direction vector, a designated exit or waypoint must be defined as a polygon. The unit vector, denoted as $\\vec{e}_i^{~0}$, is then calculated by pointing from the current position of the pedestrian towards the specified exit or waypoint.\nNOTE: Given that the target is always a polygon, the objective would be the polygon\u0026rsquo;s center.\nThe anticipation velocity model in the literature The following map shows works from the literature connected to the anticipation velocity model.\nLinking the AVM Paper to 18 Key Publications\nReferences: [1] Xu, Q., Chraibi, M., Seyfried, A. (2021). Anticipation in a velocity-based model for pedestrian dynamics. Transportation Research Part C: Emerging Technologies, Volume 133. https://doi.org/10.1016/j.trc.2021.103464\n[2] Tordeux, A., Chraibi, M., Seyfried, A. (2016). Collision-Free Speed Model for Pedestrian Dynamics. In: Knoop, V., Daamen, W. (eds) Traffic and Granular Flow \u0026lsquo;15. DOI Link | Model Description ","the-anticipation-velocity-model-in-the-literature#The anticipation velocity model in the literature":"","using-the-anticipation-velocity-model-with-jupedsim#Using the anticipation velocity model with JuPedSim":"","wall-implementation-in-the-anticipation-velocity-model#Wall implementation in the Anticipation Velocity Model":""},"title":"Anticipation Velocity Model"},"/models/collision_free_speed_model/":{"data":{"":"","challenges-in-implementing-collision-free-speed-models#Challenges in Implementing Collision Free Speed Models":"Numerical solution of the first-order ordinary differential equation defined by the model is solved as follows:\nUpdate algorithm\nThe implementation of collision-free speed models presents several challenges. One challenge is the lack of definition for agent-wall interactions in the original model. However, this issue has been tackled by proposed enhancements to the model, such as Xu\u0026rsquo;s generalized velocity model. Another challenge lies in accurately calibrating the parameters in both the speed and direction models. In certain symmetrical scenarios, determining a well-defined direction function can be difficult.\nIsotropical direction influence The direction model is uniform, meaning it does not differentiate between various directions of influence. The model treats all directions equally and does not consider specific pedestrian preferences or biases in their movement. This may lead to certain unrealistic situations where the agent\u0026rsquo;s direction is influenced by agents from behind them.\nBalancing Collision Avoidance with Performance: Selecting the Appropriate Time-Step The continuous definition of the model is proved to be collision-free in any situation. However, the discretisation of the model, as often required for computational efficiency, can introduce potential collision problems. While the speed model has a fast and efficient implementation, it is crucial to select a sufficiently small time step when solving the ordinary differential equation with Euler scheme in order to ensure that the model remains collision-free. Therefore, the model is collision-free in discrete time if\n$$\\delta t \\le \\min\\left\\{\\frac T2,\\frac{l(\\sqrt2-1)}{v_0\\sqrt2}\\right\\}$$\nThe condition for collision-free dynamics is determined solely by the parameters of the speed model. For example, if we use parameter values of $T=1$ s, $v_0=1.2$ m/s and $l$, with a smallness condition on the time step approximate to $\\delta t \\le0.072$ s for explicit Euler schemes and circular pedestrian shape.\nParameter calibration Additionally, accurately calibrating the repulsion rate and distance in the direction model can prove challenging due to variation based on specific environmental conditions and crowd dynamics.\n","introduction-to-collision-free-speed-model#Introduction to collision-free speed model":"The collision-free speed model [1] is a mathematical approach designed for pedestrian dynamics, emphasizing the prevention of collisions among agents.\nThe direction in which an agent moves is determined through an isotropic combination of exponential repulsion from nearby agents. The strength of this repulsion is influenced by the proximity to others within their surroundings, treating all directions equally in terms of influence.\nAgents adjust their speed according to the nearest neighbor in their headway, allowing them to navigate through congested areas without overlapping or obstructing each other. The collision-free speed model takes into account the length of the agent, which determines the required space for movement, and the maximum achievable speed of the agent.\nThis simplified and computationally efficient model aims to mirror real-world pedestrian behaviors while maintaining smooth movement dynamics.\n","limitations-of-the-collision-free-speed-model#Limitations of the collision-free speed model":"Despite its ability to simulate pedestrian dynamics and replicate real-world phenomena, the collision-free speed model has some limitations that should be acknowledged.\nInitially, the model operates on basic assumptions and might not encompass the intricate nuances of real pedestrian actions, particularly with its representation of agents as circles. It overlooks elements like response time and visual interpretation. The model may not represent stop-and-go dynamics in crowded regions or gridlocks aptly, unless manifested in confined bottlenecks with a circular form. The model does not take into account other influencing variables like obstacles or environmental conditions that could impact pedestrian movement. Numerous studies have presented different enhancements to the collision-free speed-based pedestrian model with the aim of addressing its limitations and improving the accuracy of pedestrian simulations. For instance, Xu [2] proposed a comprehensive velocity model that takes into account wall influence and incorporates velocity-based ellipses for accurate distance calculations. Moreover, improvements were made to the direction function in order to ensure seamless changes in pedestrian directions during simulation. Similarly, other researchers such as [3], [4], and [5] introduced additional refinements to enhance the direction function further.\n","mathematical-description#Mathematical description":"Models that establish a relationship between speed and spacing, known as the OV function, were originally introduced in traffic flow studies. They have since been adapted for pedestrian modeling, offering a straightforward way to control the fundamental diagram. The collision-free speed model is mathematically represented as a derivative equation for the velocity of each pedestrian. Typically, this can be expressed as\n$$\\dot{\\mathbf{x}}_i=V_i\\big(s_i(\\mathbf{x}_i,\\mathbf{x}_j,\\ldots)\\big)\\times\\mathbf e_i(\\mathbf{x}_i,\\mathbf{x}_j,\\ldots)$$\nwhere $x_i$ represents the position of pedestrian $i$ and $V_i$ represents their speed.\nThe speed function $V_i$ regulates the overall speed of the pedestrian, while the direction function $\\textbf{e}_i$ determines the direction in which the pedestrian moves.\nDirection function The direction function is governed by a weighted sum of exponential repulsion from neighboring pedestrians, which is calibrated by the repulsion rate and distance.\nCalculation of the movement direction\nThis mathematical representation ensures that the pedestrians are able to adjust their speed and direction based on their interactions with neighboring agents, ultimately resulting in a collision-free movement.\n$$\\mathbf e_i(\\mathbf x_i,\\mathbf x_j,\\ldots)=\\frac{1}{N}\\left(\\mathbf e_0+\\sum_j R(s_{i,j})\\right)$$\nwith $\\mathbf e_0$ the desired direction, $N$ a normalization constant such that $|\\mathbf e_i|=1$ and $R(s)=a,\\exp\\big((l-s)/D\\big)$ the repulsion function calibrated by the coefficient $a\u0026gt;0$ and distance $D\u0026gt;0$.\nRepulsive influence in the direction\nSpeed function The velocity is calculated by multiplying two functions: A speed function $V_i$ and a direction function $\\textbf{e}_i$.\nInspired from car-following models, the speed function only depends on the distance to the nearest pedestrian or obstacle in front through an Optimal Velocity (OV) function.\nThe set $J_i$ of pedestrians and obstacles in front is given by\n$$J_i=\\big\\{j,~\\mathbf e_i\\cdot \\mathbf e_{ij}\\le 0~\\text{and}~|\\mathbf e_i^\\perp\\cdot\\mathbf e_{ij}|\\le l/s_{ij}\\big\\}.$$\nThe distance to the nearest pedestrian or obstacle in front is then the minimum $$s_i=\\min_{j\\in J_i}s_{ij}.$$\nIn the following, the OV function is the piecewise linear $$V(s)=\\min\\big\\{v_0,\\max{0,(s-l)/T}\\big\\},$$\nsatisfies\n$$\\begin{align*}V(s)\u0026amp;\\gt0\\quad\\forall s\\gt l\\\\ V(s)\u0026amp;=0\\quad\\forall s\\le\\ell\\end{align*}$$\nOV speed function vs fundamental diagram\nThe spacing is calculated along the direction of motion and is defined as the spacing to the nearest neighbor that may collide with the agent. See following picture:\nCalculation of the minimal speed in the direction of motion\nParameters The collision-free speed model depends on five parameters:\nPedestrian diameter ($l \\ge 0$) Desired speed ($v_0 \u0026gt; 0$) Time gap ($T \u0026gt; 0$) Repulsion rate and distance ($a\u0026gt;0$ and $D\u0026gt;0$) ","references#References":" [1] Tordeux, A., Chraibi, M., Seyfried, A. (2016). Collision-Free Speed Model for Pedestrian Dynamics. In: Knoop, V., Daamen, W. (eds) Traffic and Granular Flow \u0026lsquo;15. https://doi.org/10.1007/978-3-319-33482-0_29\n[2] Xu, Q., Chraibi, M., Tordeux, M., Zhang (2019). Generalized collision-free velocity model for pedestrian dynamics. Physica A: Statistical Mechanics and its Applications, Volume 535. https://doi.org/10.1016/j.physa.2019.122521\n[3] Rzezonka, J., Chraibi, M., Seyfried, A., Hein, B., Schadschneider, A. (2022). An attempt to distinguish physical and socio-psychological influences on pedestrian bottleneck. Royal Society Open Science. https://royalsocietypublishing.org/doi/10.1098/rsos.211822\n[4] Zhang, S., Zhang, J., Chraibi, M., Song, W. (2021). A speed-based model for crowd simulation considering walking preferences. Communications in Nonlinear Science and Numerical Simulation, Volume 95. https://doi.org/10.1016/j.cnsns.2020.105624\n[5] Xu, Q., Chraibi, M., Seyfried, A. (2021). Anticipation in a velocity-based model for pedestrian dynamics. Transportation Research Part C: Emerging Technologies, Volume 133. https://doi.org/10.1016/j.trc.2021.103464\n[6] Tordeux, A. talk in TGF15, Delft. Slides.\n"},"title":"Collision Free Speed Model"},"/models/generalized_centrifugal_force_model/":{"data":{"":"","basic-principles-of-generalized-centrifugal-force-model#Basic Principles of Generalized Centrifugal Force Model":"GCFM belongs to the class of force-based pedestrian models, which view pedestrian movement as the result of forces acting on an individual at any given moment. These so-called acceleration-based models calculate the acceleration of agents by superposing the forces acting on them.\nThe movement of pedestrians is influenced by three main forces in the Generalized Centrifugal Force Model: the destination driving force, the obstacle repulsive force, and the repulsive force between pedestrians. The destination driving force propels individuals towards their intended destinations, taking into account factors such as distance and desired walking speed. On the other hand, the obstacle-repulsive force pushes pedestrians away from obstacles to maintain a safe distance from walls or other objects. Lastly, the repulsive force between pedestrians prevents collisions among them [1].\nThe model considers both the distance between pedestrians and their relative velocities. Using an elliptical volume exclusion instead of a circular one has several advantages. Circular symmetry is inconsistent with the asymmetric space requirements of pedestrians in terms of their motion direction and transverse to it. As a force-based model, GCFM describes the temporal changes in pedestrian movement through the combination of short-range forces acting on them simultaneously.\n","challenges-in-implementing-gcfm#Challenges in Implementing GCFM":"The computational cost of the GCFM is high, as it requires continuous\ncalculations to determine the forces and interactions between pedestrians. This\nincludes calculating distances between ellipses, such as the closest approach\ndistance. Additionally, while the strength of repulsive force decreases with\nincreasing distance between pedestrians, it currently has an infinite range,\nwhich is unrealistic for pedestrian interactions. To address this, we propose\nintroducing a cutoff radius for the force to limit interactions only to\nadjacent pedestrians. However, implementing this cutoff radius requires a\ntwo-sided Hermite-interpolation of the repulsive force and further increases\ncomputational complexity. Furthermore, finding appropriate values for model\nparameters that are independent of neighborhood properties and reduce\noverlapping and oscillation is challenging.","introduction-to-generalized-centrifugal-force-model#Introduction to Generalized Centrifugal Force Model":"The Generalized Centrifugal Force Model [1] is a force-based model that defines the movement of pedestrians through the combination of small-range forces. This model represents the spatial requirement of pedestrians, including their body asymmetry, in an elliptical shape with two axes dependent on speed. The semi-axis representing the dynamic space requirement in the direction of motion increases proportionally as speed increases. Conversely, the semi-axis along the shoulder direction decreases with higher velocities.","limitations-of-the-gcfm#Limitations of the GCFM":"As a force-based model, the GCFM suffers from several drawbacks typical for force-based models, namely the duality problem of overlapping and oscillations.\nIt is possible to reduce the amount of overlapping among agents, by increasing the strength of the repulsive forces. However, this leads inevitably to an increase of oscillations in the movements of agents, which in turn can only be mitigated by decreasing the strength of the repulsive forces. See [2] for a more in-depth analysis of this issue.\n","mathematical-description#Mathematical description":"Elliptical volume exclusion of agents The Generalized Centrifugal Force Model incorporates an elliptical volume exclusion of pedestrians. This means that pedestrians are represented as elliptical disks with two semi-axes, which depend on their speed. The semi-axis representing the dynamic space requirement in the direction of motion ($a$) increases proportionally as speed increases, while the semi-axis along the shoulder direction decreases with higher speed values ($b$).\nThe distance between the borders of the ellipses along a line connecting their centers.\nThe mathematical description of the elliptical volume exclusion in GCFM is as follows\n$$a=a_{\\min }+\\tau_a v_i$$\nand\n$$b=b_{\\max }-\\left(b_{\\max }-b_{\\min }\\right) \\frac{v_i}{v_i^0},$$\nwhere $v_i$ is the speed and $v_i^0$ the desired speed of agent $i$.\nEquation of motion The behavior of agents in motion is influenced by the presence of others, causing them to deviate from a straight path. Drawing parallels to Newtonian mechanics, such deviations or accelerations are attributed to a force. Hence, the equation of motion can be written as:\n$$\\vec{\\ddot x}_i=\\overrightarrow{F_i^{\\mathrm{drv}}}+\\sum_{j \\in \\mathcal{N}_{i}} \\overrightarrow{F_{i j}^{\\mathrm{rep}}}+\\sum_{w \\in \\mathcal{W}_{i}} \\overrightarrow{F_{i w}^{\\mathrm{rep}}}.$$\nDriving force The driving force in the Generalized Centrifugal Force Model is defined as the force that propels pedestrians towards their intended destinations:\n$$\\vec{F}_i^{\\mathrm{drv}}=m_i \\frac{\\overrightarrow{v_i^0}-\\overrightarrow{v_i}}{\\tau}.$$\nPedestrian-pedestrian repulsive force The pedestrian-pedestrian repulsive force in the Generalized Centrifugal Force Model is defined as the force that prevents collisions between pedestrians. By considering the repulsive force between pedestrians, the Generalized Centrifugal Force Model ensures that individuals maintain a safe distance from each other.\n$${\\overrightarrow{F_{i,j}}}_{\\text {rep }}=-m_i k_{i j} \\frac{\\left(\\eta\\left|\\overrightarrow{v_i^0}\\right|+v_{i j}\\right)^2}{d_{i j}} \\overrightarrow{e_{i j}},$$\nwith the relative speed\n$$v_{i j}=\\frac{1}{2}\\left[\\left(\\overrightarrow{v_i}-\\overrightarrow{v_j}\\right) \\cdot \\overrightarrow{e_{i j}}+\\left|\\left(\\overrightarrow{v_i}-\\overrightarrow{v_j}\\right) \\cdot \\overrightarrow{e_{i j}}\\right|\\right],$$\nand a reduction of the influence range to $180^\\circ$ by:\n$$k_{i j}=\\frac{1}{2} \\frac{\\overrightarrow{v_i} \\cdot \\overrightarrow{e_{i j}}+\\left|\\overrightarrow{v_i} \\cdot \\overrightarrow{e_{i j}}\\right|}{v_i}.$$\nThe interpolation of the repulsive force between pedestrians.\nPedestrian-wall repulsive force In the Generalized Centrifugal Force Model, the repulsive force between pedestrians and walls represents the force that propels pedestrians away from walls and other fixed structures. For a pedestrian labeled as $i$, this repulsive force is nullified when $i$ moves parallel to the wall. However, while this force behavior is accurate, it results in minimal repulsion when the pedestrian\u0026rsquo;s trajectory is nearly aligned with the wall.\nFor this reason, we characterize in this model walls by three-point masses acting on pedestrians within a certain interaction range.\nEach wall is modeled as three static point masses acting on pedestrians.\n","references#References:":" [1] Chraibi, M., Seyfried, A., Schadschneider, A. (2010). Generalized centrifugal-force model for pedestrian dynamics, Physical Review E, 82, 4 https://link.aps.org/doi/10.1103/PhysRevE.82.046111 [2] Chraibi, M., Schadschneider, A., Seyfried, A. (2013). On Force-Based Modeling of Pedestrian Dynamics. https://doi.org/10.1007/978-1-4614-8483-7_2 "},"title":"Generalized Centrifugal Force Model"},"/models/optimal_steps_model/":{"data":{"":"","implementation-in-vadere-challenges-limitations-usage-parameters#Implementation in Vadere, Challenges, Limitations, Usage, Parameters":"Vadere simulator The Vadere project was started in 2010. Its main intention was and still is to facilitate development and comparison of locomotion models. Therefore, it was designed as a generic framework, but with an eye on keeping it lightweight, so that new locomotion models can be quickly implemented. Vadere has an event-driven update scheme and a simulation loop.\nVadere simulation loop.\nThe Optimal Steps Model implements the locomotion model interface Model that contains four essential methods:\ninitialize() : compute floorfield, initialize step circle optimizer and update scheme. preLoop() : set last time step. postLoop() : shut down update scheme. update() : set new time step and solve optimization problem to find the next position. Usage Vadere is implemented in Java programming language. Thus, it is available for GNU-/Linux, MacOS and Microsoft Windows. Vadere reads in simulation parameters, like the topography or an agent’s radius, from a human-readable JSON-based text file instead of using a binary format. Also, the simulation results — usually x and y coordinates for each pedestrian and a time step — are written to text files. In this way, users can use text editors to create input files for Vadere and they can open result files from Vadere with 3rd-party software like MATLAB. Furthermore, text files allow users to modify parameters quickly in an automated way. This is essential for studies where parameters must be varied and, thus, thousands of simulations must be run. Performing simulations with Vadere requires three steps. These steps are supported by the graphical user interface.\nVadere interface.\nChallenges and limitations Using the OSM involves solving many optimization problems. For each step of each agent, a non-trivial optimization problem has to be solved. This optimization is computationally expensive and requires most of the overall computation time. Introducing more complex potential functions complicates the evaluation of the potential function which contributes directly to the computation time of the optimization. Evaluating the potential function at specific points only instead of using an optimization technique such as Nelder Mead can accelerate the simulation. Note that when you cut down the number of evaluation points to 8, this will mimic a cellular automaton.\nGrid discrimination.\nThis is aggravated by the fact that a strict event-driven update hinders parallelization of the computation. Therefore, simulating thousands of agents in real-time using the OSM with Vadere is not yet possible. Benedikt Zönnchen worked on the acceleration in his dissertation thesis.\nParameters The shape of the potential function is controlled through several parameters. There are two parameters that are especially important for the distancing behavior which is why we introduce them briefly:\nthe potential height $h$ (in Vadere: pedPotentialHeight) and the personal space width $w$ (in Vadere: pedPotentialPersonalSpaceWidth). The parameter potential height $h$ controls the strength of repulsion. If $h$ is increased, we expect agents to increase their distance to others.\nThe parameter personal space width $w$ controls how far the repulsion reaches: the larger $w$ the bigger the influence area of an agent. By adusting the personal space width $w$ [5] social distancing can be achieved. Nevertheless, the personal space is related to but not equal to a desired social distance $d$ the user wants to model. When there is ample space, it might suffice to set $w = d$ to keep agents at least the desired social distance apart. Since the true distance between agents is an emergent value, the distance is larger [5].\n","introduction#Introduction":"The basic idea of the Optimal Steps Model (OSM) is that virtual pedestrians (agents) try to improve their situation with every step. The utility of each position in space is coded in a scalar function called floor field. Utility increases when approaching targets and decreases when getting too close to obstacles and other virtual pedestrians. From a physical perspective, agents in motion are drawn towards targets while being repelled by obstacles and other agents. In other words, the negative utility can be understood as a potential that agents aim to minimize. The utility, or potential, depends on the geodesic distance to the target and the proximity to other agents.\nSchematic solution of routing with OSM. Master thesis C. Mayr: The Heat Method for geodesic distance computation on 2D domains\nAgents move by stepping on the position on a circle (or disk) around their current location that optimizes this utility. The circle radius represents each agent\u0026rsquo;s personal maximum stride length, which in turn is linearly correlated to the agent\u0026rsquo;s free-flow speed [1], that is, an assumed desired speed when the path is free. Thus, agents step toward targets while skirting obstacles and avoiding collisions. For the remainder of the text and in the figures, we adopt the physical interpretation consistent with the parameter names in Vadere\u0026rsquo;s implementation of the OSM.\nModeling steps with OSM.\n","mathematical-description#Mathematical description":"The potential $P_l(x)$ for pedestrian $l$ at time $t$ for an arbitrary point $x \\in \\mathbb{R}^2$ in the plane is defined as [1]\n$$ P_l(x) = P_t(x,s) + \\sum_{j=1}^m P_{o,j}(x) + \\sum_{i=1,i\\neq l}^n P_{p,i}(x), $$\nwhere $P_t(x,s)$ is the attraction potential of the target, $s$ is the vector of the current agent positions, $P_{o,j}(x)$ is the repulsive potential induced by obstacle $j$, $m$ is the number of obstacles, $P_{p,i}$ is the repulsive potential of other agents, $n$ is the number of agents. The implementation of the attraction potential $P_t(x)$ is the so-called floor field. If the attraction potential does not depend on the agents\u0026rsquo; current positions, means $P_t(x,s)=P_t(x)$, the floor field is static. Otherwise, it is dynamic. If we consider the floor field to be static, the value of the potential function at position $x$ equals the negative geodesic distance between $x$ and the target.\nThe obstacle potential $P_{o,j}(x)$ is defined as\n$$ P_{o,j}(x) = \\begin{array}{ll} \\delta_1(x) + \\delta_2(x) \u0026amp; d_{o,j}(x) \u0026lt; r_l \\\\ \\delta_1(x) \u0026amp; r_l \\leq d_{o,j}(x) \u0026lt; w_o \\\\ 0 \u0026amp; \\textrm{otherwise,} \\\\ \\end{array} $$ where $d_{o,j}(x)$ is the Euclidean distance to the closest point of the obstacle from position $x$, $w_o$ defines the width of the obstacle repulsion, $r_l$ is the torso radius of agent $l$. The functions $\\delta_i$ are defined as $$ \\begin{align} \\delta_1(x) \u0026amp;= 6 \\exp{\\left[ 2 \\left( \\left( \\frac{d_{o,j}(x)} {w_o} \\right)^{2} - 1\\right)^{-1} \\right]};\\text{and}\\\\ \\delta_2(x) \u0026amp;= 10^5 \\exp{\\left[ \\left( \\left( \\frac{d_{o,j}(x)} {r_l} \\right)^{2} - 1\\right)^{-1} \\right]}. \\ \\end{align} $$ The repulsion between two agents is achieved by the distance-dependent potential function $P_{p,i}$. In Vadere, it is implemented as\n$$ P_{p,i}(x) = \\begin{array}{ll} \\phi_1(d_{l,i}(x)) + \\phi_2(d_{l,i}(x)) + \\phi_3(d_{l,i}(x)) \u0026amp; d_{l,i}(x) \u0026lt;r_i + r_l, \\\\ \\phi_1(d_{l,i}(x)) + \\phi_2(d_{l,i}(x)) \u0026amp; r_i + r_l \\leq d_{l,i}(x) \u0026lt; w_{int} +r_i+r_l, \\\\ \\phi_1(d_{l,i}(x)) \u0026amp; w_{int} + r_i + r_l \\leq d_{l,i}(x) \u0026lt; w+r_i+r_l\\\\ 0, \u0026amp; \\textrm{otherwise,} \\\\ \\end{array} $$\nwhere $d_{l,i}(x)$ is the Euclidean distance between agent $l$ and agent $i$. $r_i, r_l$ are the respective torso radii of agent $i,l$. $w_{int}$ and $w$ are the intimate and the personal space width according to Hall. The functions $\\phi_i$ are defined as $$ \\begin{align} \\phi_1({d_{i,j}}) \u0026amp;= \\mu \\exp{\\left[ 4 \\left( \\left( \\frac{d_{i,j}} {w +r_i +r_l} \\right)^{2} - 1\\right)^{-1} \\right]} \\\\ \\phi_2({d_{i,j}}) \u0026amp;= \\frac{ \\mu } {a_p} \\exp{\\left[ 4 \\left( \\left( \\frac{d_{i,j}} {w_{int} +r_i +r_l} \\right)^{2} - 1\\right)^{-1} \\right]} \\\\ \\phi_3({d_{i,j}}) \u0026amp;= 10^3 \\exp{\\left[ \\left( \\left( \\frac{d_{i,j}} {r_i +r_l} \\right)^{2} - 1\\right)^{-1} \\right]} \\end{align} $$\nThe potential function is based on Hall\u0026rsquo;s theory of interpersonal distances which describes four distance zones around a person [4]. Accordingly, the potential function is defined piece-wise on rings around each agent: a circular core for collision avoidance, a first ring that represents the intimate space, and a second ring that represents personal space. Agents outside the personal zone do not affect other agents\u0026rsquo; path choice. This is mathematically modeled by setting the the potential function to zero.\nAgent\u0026rsquo;s potential versus distance for different parameter values. [5]\nThe value of the potential function in the personal space ring is very low. Thus, this area will be kept free only if agents have ample space to avoid each other [3]. As soon as the space becomes more constricted agents will get closer. This is typical for normal human behavior. In the intimate space ring, the potential function value increases significantly. In crowds, this area is only kept free if the density is low [3]. Finally, to prevent agents from overlapping, the potential is set to a high value (compared to the values for the personal and intimate spaces) in the collision area. The exact definition of the potential function and default parameters implemented in Vadere can be found in [2].\n","references#References":" [1] Michael J. Seitz and Gerta Köster. Natural discretization of pedestrian movement in continuous space. Physical Review E, 86(4):046108, 2012. https://doi.org/10.1103/PhysRevE.86.046108\n[2] Benedikt Kleinmeier, Benedikt Zönnchen, Marion Gödel, and Gerta Köster. Vadere: An open-source simulation framework to promote interdisciplinary understanding. Collective Dynamics, 4, 2019. https://doi.org/10.17815/CD.2019.21\n[3] von Sivers, Isabella Katharina Maximiliana. Modellierung sozialpsychologischer Faktoren in Personenstromsimulationen. Dissertation Technical University Munich, 2016.\n[4] Edward Twitchell Hall. The Hidden Dimension. Doubleday, New York, 1966.\n[5] Christina M. Mayr and Gerta Köster. Social distancing with the Optimal Steps Model. Collective Dynamics, 2021. https://doi.org/10.17815/CD.2021.116\n[5] Xu, Q., Chraibi, M., Seyfried, A. (2021). Anticipation in a velocity-based model for pedestrian dynamics. Transportation Research Part C: Emerging Technologies, Volume 133.\n"},"title":"Optimal Steps Model"},"/models/social_force_model/":{"data":{"":"","calculating-new-velocity-and-new-position-from-forces#Calculating new velocity and new position from forces":"With the definition of the forces affecting an individual, it is possible to calculate its new speed\n$$ \\overrightarrow{v_{\\mathrm{new}}} = \\overrightarrow{v_i} + [\\overrightarrow{F_i^{\\mathrm{drv}}} + \\frac{\\overrightarrow{F_i^{\\mathrm{rep}}} + \\overrightarrow{F_i^{\\mathrm{obst}}}}{m_i}] \\cdot \\delta T$$ and position $$ \\overrightarrow{\\mathrm{pos}_{\\mathrm{new}}} = \\overrightarrow{\\mathrm{pos}_i} + \\overrightarrow{v_{\\mathrm{new}}} \\cdot \\delta T \\text{.}$$\nHere $m_i$ denotes the mass of $i$ and $\\delta T$ denotes the length one simulation iteration.\n","default-values#Default values":"\nParameter Value Unit $A_i$ 2_000 N $B_i$ 0.08 m $k$ 120_000 $\\mathrm{\\frac{kg}{s^2}}$ $\\kappa$ 240_000 $\\mathrm{\\frac{kg}{m \\cdot s}}$ $r_i$ 0.3 m $\\tau$ 0.5 s $v_i^0$ 0.8 $\\mathrm{\\frac{m}{s}}$ $m$ 80 kg ","driving-force#Driving force":"The driving force defines the force that propels pedestrians towards their intended destinations:\n$$ \\overrightarrow{F_i^{\\mathrm{drv}}}=\\frac{v_i^0\\overrightarrow{e_i^0} - \\overrightarrow{v_i}}{\\tau}$$\n$v_i^0$ is the desired speed $\\overrightarrow{e_i^0}$ is the desired direction $\\overrightarrow{v_i}$ is the currect velocity $\\tau$ is the reaction time Driving Force acting on an agent.\nIn the figure above, the black dot represents an agent. Its radius is represented by the gray circle around it. The desired velocity ($v_i^0 \\overrightarrow{e_i^0}$) is as big as its desired speed and is pointing in the desired direction towards a destination indicated by an X. The driving force of the agent results from the difference between the desired velocity and the current velocity divided by $\\tau$.\n","introduction-to-social-force-model#Introduction to Social Force Model":"The Social Force Model [1] is a force-based model that defines the movement of pedestrians by the combination of different social forces affecting an individual.\nThe model defines forces that affect an individual:\nA driving force A repulsive force An obstacle force The driving force represents a person\u0026rsquo;s desire to move in a certain direction, independent of other people and obstacles. The repulsive force is caused by the interaction between the individuals and causes them to avoid each other in order to avoid collisions. The obstacle force acts in a similar way to the person force to avoid collisions with obstacles in the environment.\n","obstacle-force#Obstacle force":"Obstacles exert a force on the agent similar to a static agent. Each line segment of an obstacle exerts force on the agent. The repulsive force is increases exponentially with decreasing distance. When the agent collides with the segment the repulsive forces are increased additionally. When colliding, a frictional force also occurs, which acts orthogonally to the repulsive force in the direction to the velocity of the agent\n$$ \\overrightarrow{F_i^{\\mathrm{obst}}} = \\sum_{o} \\overrightarrow{f_{io}\\text{.}}$$\n$$\\overrightarrow{f_{io}} = [A_i \\exp[(r_{i} - d_{io})/B_i] + kg(r_{i} - d_{io})] \\overrightarrow{n_{io}} + \\kappa g(r_{i} - d_{io}) (\\overrightarrow{v_{i}}\\cdot\\overrightarrow{t_{io}}) \\overrightarrow{t_{io}} \\text{.}$$\n$$\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;}\\fbox{\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;} pushing \\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;..}} \\fbox{\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;.} sliding \\phantom{\u0026hellip;\u0026hellip;\u0026hellip;.}}$$\n$o$ is a segment of the obstacle $r_i$ is the radius agent $i$ $d_{io}$ is distance from closest point on the segement to $i$ $\\overrightarrow{n_{io}} = (n_{io}^1, n_{io}^2) = (\\overrightarrow{\\mathrm{pos}_i} - \\overrightarrow{\\mathrm{pos}_o})/d_{io}$ the direction from $\\overrightarrow{\\mathrm{pos}_o}$ the closest point on the segment to $i$ $ \\overrightarrow{t_{io}} = (- n_{io}^2, n_{io}^1)$ is the tangent of $\\overrightarrow{n_{io}}$ which is perpendicular to it, rotated counterclockwise $v_i$ is the velocity of $i$ $A_i$, $B_i$, $k$ and $\\kappa$ are constants (see default values) $g$ represents the distance between a pedestrian and an obstacle segment when they are in contact, and is zero when there is no contact. $g(x)~=~\\begin{cases} x \\text{ if } x \u0026gt; 0 \\ \\text{ else } 0 \\end{cases}$ Direction of repulsive forces acting on an agent.\nthe repulsive force originating from a segment of an obstacle acts from the point on the wall segment that is closest to the agent. This point is marked in magenta in the illustration above.\nDirection of the pushing and frictional forces acting on agents colliding with an obstacle segment.\nWhen the minimum distance between an agent and a wall segment falls below the agent\u0026rsquo;s radius, an additional frictional force comes into effect. This frictional force acts orthogonally to the repulsive force in the direction of the velocity of the agent.\n","references#References":" [1] Helbing, D., Farkas, I., Vicsek, T. (2000). Simulating dynamical features of escape panic. In: Nature https://doi.org/10.1038/35035023 ","repulsive-force#Repulsive force":"Agents exert an exponentially increasing repulsive force on each other as their proximity decreases. Upon collision, not only do the pushing forces intensify further, but a frictional force also arises. This frictional force acts perpendicularly to the repulsive force, aligning with the direction of the difference in speed\n$$ \\overrightarrow{F_i^{\\mathrm{rep}}} = \\sum_{j} \\overrightarrow{f_{ij}}\\text{.}$$\n$$\\overrightarrow{f_{ij}} = [A_i \\exp[(r_{ij} - d_{ij})/B_i] + kg(r_{ij} - d_{ij})] \\overrightarrow{n_{ij}} + \\kappa g(r_{ij} - d_{ij}) \\Delta v_{ji}^t \\overrightarrow{t_{ij}} \\text{.}$$\n$$\\phantom{\u0026hellip;\u0026hellip;}\\fbox{\\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;..} pushing \\phantom{\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;\u0026hellip;..}} \\fbox{\\phantom{\u0026hellip;\u0026hellip;} sliding \\phantom{\u0026hellip;\u0026hellip;}}$$\n$j$ is another agent $r_{ij} = r_i + r_j$ is the combined radius of $i$ and $j$ $d_{ij}$ is the distance between $i$ and $j$ $A_i$, $B_i$, $k$ and $\\kappa$ are constants (see default values) $g$ represents the distance between pedestrians when they are in contact, and is zero when there is no contact. $g(x)~=~\\begin{cases} x \\text{ if } x \u0026gt; 0 \\ \\text{ else } 0 \\end{cases}$ $ \\overrightarrow{n_{ij}} = (n_{ij}^1, n_{ij}^2) = (\\overrightarrow{\\mathrm{pos}_i} - \\overrightarrow{\\mathrm{pos}_j})/d_{ij} $ is the normalised vector from $j$ to $i$ $ \\overrightarrow{t_{ij}} = (- n_{ij}^2, n_{ij}^1)$ is the tangent of $\\overrightarrow{n_{ij}}$ which is perpendicular to it, rotated counterclockwise $\\Delta v_{ji}^t = (\\overrightarrow{v_j} - \\overrightarrow{v_i}) \\cdot \\overrightarrow{t_{ij}}$ is the tangential velocity difference of $i$ and $j$ Direction of repulsive forces acting on an agent.\nThe repulsive force of the agents acts from the originating agent towards the agent on which the forces act. When their distance greater than their combined radius no other forces apply.\nDirection of the pushing and frictional forces acting on colliding agents.\nIf the distance between two agents is smaller than their combined radius, the agents collide and a frictional force also occurs. This frictional force acts orthogonally to the repulsive force in the direction of the velocity difference of the two agents.\n"},"title":"Social Force Model"},"/open_source_software/":{"data":{"":"If you know other open source software that fits the broad category of pedestrian dynamics we would like to hear about it! Feel free to open an issue on our GitHub or contact us directly!\nPedPyA Python module to analyze real and simulated pedestrian trajectories. JuPedSimA Python module to simulate pedestrian dynamics. VADEREA Java framework for the simulation of microscopic pedestrian and crowd dynamics. PeTrackAutomatic Extraction of Pedestrian Trajectories from Video Recordings. UMANSC++ crowd-simulation framework for experimentation and for honest comparisons between algorithms. CROMOSIMA Python Library for microscopic Crowd Motion Simulation. datafoldLearn operator-theoretic models for dynamical systems from time series data. "},"title":"Open Source Software"}}